Repository: subashree639/BIOSECURITY
Catalog: lib/l10n/app_*.arb
Languages: hi, ta

# appTitle
source: ABC (Antibiotic Check)
hi: एबीसी (एंटीबायोटिक चेक)
ta: ஏபிசி (ஆன்டிபயாடிக் செக்)

# appSubtitle
source: Antibiotic Check for Farmers
hi: किसानों के लिए एंटीबायोटिक चेक
ta: விவசாயிகளுக்கு ஆன்டிபயாடிக் செக்

source: Farmer
hi: किसान
ta: விவசாயி

source: Vet
hi: पशु चिकित्सक
ta: மருத்துவர்

source: Seller
hi: विक्रेता
ta: விற்பனையாளர்

source: Login
hi: लॉगिन
ta: உள்நுழை

source: Register
hi: पंजीकरण
ta: பதிவு செய்

# newToApp
source: New to app? Register
hi: ऐप में नए हैं? पंजीकरण करें
ta: பயன்பாட்டில் புதியவரா? பதிவு செய்

# tapMicSayPassphrase
source: Tap mic & say your passphrase
hi: माइक पर टैप करें और अपना पासफ्रेज बोलें
ta: மைக் அழுத்தி உங்கள் கடவுச்சொல்லை சொல்லுங்கள்

# voiceRegistered
source: Voice registered — ID: {id}
hi: वॉइस पंजीकृत — आईडी: {id}
ta: குரல் பதிவு செய்யப்பட்டது — ஐடி: {id}

# listening
source: Farmer — Listening...
hi: किसान — सुन रहा है...
ta: விவசாயி — கேட்கிறது...

# loginWithMobile
source: Login with Mobile (OTP)
hi: मोबाइल के साथ लॉगिन (OTP)
ta: மொபைல் மூலம் உள்நுழை (OTP)

source: Enter mobile number
hi: मोबाइल नंबर दर्ज करें
ta: மொபைல் எண்ணை உள்ளீடு செய்யுங்கள்

source: Send OTP
hi: OTP भेजें
ta: OTP அனுப்பு

source: Verify & Login
hi: सत्यापित करें और लॉगिन करें
ta: சரிபார்த்து உள்நுழை

source: Resend OTP
hi: OTP पुनः भेजें
ta: OTP மீண்டும் அனுப்பு

# enterOTP
source: Enter 6-digit OTP
hi: 6-अंकीय OTP दर्ज करें
ta: 6-இலக்க OTP உள்ளீடு செய்யுங்கள்

# otpSentTo
source: OTP sent to {number}
hi: OTP भेजा गया: {number}
ta: OTP அனுப்பப்பட்டது: {number}

source: Incorrect OTP
hi: गलत OTP
ta: தவறான OTP

source: Enter valid mobile
hi: मान्य मोबाइल दर्ज करें
ta: சரியான மொபைல் உள்ளீடு செய்யுங்கள்

# mockOTP
source: Mock OTP: {otp}
hi: मॉक OTP: {otp}
ta: மாக் OTP: {otp}

# mockOTPFarmer
source: Mock OTP (farmer): {otp}
hi: मॉक OTP (किसान): {otp}
ta: மாக் OTP (விவசாயி): {otp}

# mockOTPSeller
source: Mock OTP (seller): {otp}
hi: मॉक OTP (विक्रेता): {otp}
ta: மாக் OTP (விற்பனையாளர்): {otp}

source: Veterinary Login
hi: पशु चिकित्सा लॉगिन
ta: மருத்துவ உள்நுழைவு

# pleaseEnterLoginDetails
source: Please enter your login details
hi: कृपया अपना लॉगिन विवरण दर्ज करें
ta: உங்கள் உள்நுழைவு விவரங்களை உள்ளீடு செய்யுங்கள்

source: Username
hi: उपयोगकर्ता नाम
ta: பயனர்பெயர்

source: Password
hi: पासवर्ड
ta: கடவுச்சொல்

source: Vet ID / Reg No
hi: पशु चिकित्सक आईडी / पंजीकरण संख्या
ta: மருத்துவர் ஐடி / பதிவு எண்

source: Login as Vet
hi: पशु चिकित्सक के रूप में लॉगिन करें
ta: மருத்துவராக உள்நுழை

# newToAppRegisterVet
source: New to app? Register as Vet
hi: ऐप में नए हैं? पशु चिकित्सक के रूप में पंजीकरण करें
ta: பயன்பாட்டில் புதியவரா? மருத்துவராக பதிவு செய்

source: Verifying...
hi: सत्यापित किया जा रहा है...
ta: சரிபார்க்கிறது...

source: Invalid vet credentials
hi: अमान्य पशु चिकित्सक क्रेडेंशियल
ta: தவறான மருத்துவர் சான்றுகள்

source: Seller / User
hi: विक्रेता / उपयोगकर्ता
ta: விற்பனையாளர் / பயனர்

# pleaseEnterPhoneNumber
source: Please enter your phone number
hi: कृपया अपना फोन नंबर दर्ज करें
ta: உங்கள் தொலைபேசி எண்ணை உள்ளீடு செய்யுங்கள்

source: Verify OTP
hi: OTP सत्यापित करें
ta: OTP சரிபார்க்க

source: OTP sent
hi: OTP भेजा गया
ta: OTP அனுப்பப்பட்டது

source: Register as Farmer
hi: किसान के रूप में पंजीकरण करें
ta: விவசாயியாக பதிவு செய்

# welcomeRegister
source: Welcome! Register to use ABC — choose voice or mobile registration
hi: स्वागत है! एबीसी का उपयोग करने के लिए पंजीकरण करें — वॉइस या मोबाइल पंजीकरण चुनें
ta: வரவேற்கிறோம்! ஏபிசி பயன்படுத்த பதிவு செய்யுங்கள் — குரல் அல்லது மொபைல் பதிவை தேர்ந்தெடுக்கவும்

source: Voice Registration
hi: वॉइस पंजीकरण
ta: குரல் பதிவு

# voiceRegDesc
source: Register voice profile (simulated enroll). Create a simple Farmer ID you can share with vets.
hi: वॉइस प्रोफाइल पंजीकृत करें (सिमुलेटेड एनरोल)। एक साधारण किसान आईडी बनाएं जिसे आप पशु चिकित्सकों के साथ साझा कर सकते हैं।
ta: குரல் சுயவிவரத்தை பதிவு செய்யுங்கள் (சிமுலேட் என்ரோல்). விவசாயிகளுடன் பகிரக்கூடிய ஒரு எளிய விவசாயி ஐடியை உருவாக்குங்கள்.

source: Mobile Registration
hi: मोबाइल पंजीकरण
ta: மொபைல் பதிவு

# mobileRegDesc
source: Register using your phone number (OTP). You can keep your phone as Farmer ID or choose a custom ID.
hi: अपने फोन नंबर का उपयोग करके पंजीकरण करें (OTP)। आप अपने फोन को किसान आईडी के रूप में रख सकते हैं या एक कस्टम आईडी चुन सकते हैं।
ta: உங்கள் தொலைபேசி எண்ணைப் பயன்படுத்தி பதிவு செய்யுங்கள் (OTP). உங்கள் தொலைபேசியை விவசாயி ஐடியாக வைத்திருக்கலாம் அல்லது ஒரு தனிப்பயன் ஐடியை தேர்ந்தெடுக்கலாம்.

# voiceEnrollment
source: Voice Enrollment (simulated)
hi: वॉइस एनरोलमेंट (सिमुलेटेड)
ta: குரல் என்ரோல்மென்ட் (சிமுலேட்)

# tapEnrollStart
source: Tap ENROLL to start voice capture. You will be asked to say a short phrase three times.
hi: वॉइस कैप्चर शुरू करने के लिए ENROLL पर टैप करें। आपको तीन बार एक छोटा वाक्य बोलना होगा।
ta: குரல் கேப்சர் தொடங்க ENROLL அழுத்தவும். உங்களுக்கு மூன்று முறை ஒரு சிறிய வாக்கியத்தை சொல்ல கேட்கப்படும்.

# recordingVoice
source: Recording your voice — hold still and speak the phrase when prompted.
hi: आपकी आवाज रिकॉर्ड की जा रही है — स्थिर रहें और जब संकेत मिले तो वाक्य बोलें।
ta: உங்கள் குரலை பதிவு செய்கிறது — நிலையாக இருங்கள் மற்றும் குறிப்பிடப்பட்டபோது வாக்கியத்தை சொல்லுங்கள்.

# enrollmentComplete
source: Enrollment complete — your Farmer ID is:
hi: एनरोलमेंट पूरा हुआ — आपका किसान आईडी है:
ta: என்ரோல்மென்ட் முடிந்தது — உங்கள் விவசாயி ஐடி:

source: Enroll Voice
hi: वॉइस एनरोल करें
ta: குரல் என்ரோல் செய்

source: Cancel
hi: रद्द करें
ta: ரத்து செய்

source: Processing enrollment...
hi: एनरोलमेंट प्रोसेस किया जा रहा है...
ta: என்ரோல்மென்ட் செயலாக்கம்...

source: Continue to Dashboard
hi: डैशबोर्ड पर जारी रखें
ta: டாஷ்போர்டுக்கு தொடர்ந்து

source: Retry Enrollment
hi: एनरोलमेंट पुनः प्रयास करें
ta: என்ரோல்மென்ட் மீண்டும் முயற்சி செய்

source: Register by Mobile
hi: मोबाइल द्वारा पंजीकरण करें
ta: மொபைல் மூலம் பதிவு செய்

source: Mobile number
hi: मोबाइल नंबर
ta: மொபைல் எண்

source: Add custom ID?
hi: कस्टम आईडी जोड़ें?
ta: தனிப்பயன் ஐடி சேர்க்க?

# customFarmerId
source: Custom Farmer ID (alphanumeric)
hi: कस्टम किसान आईडी (अक्षरांकीय)
ta: தனிப்பயன் விவசாயி ஐடி (அக்ஷரங்கள் மற்றும் எண்கள்)

# ifNotCustom
source: If you do not provide a custom ID, your phone number will be used as your Farmer ID.
hi: यदि आप एक कस्टम आईडी प्रदान नहीं करते हैं, तो आपका फोन नंबर आपके किसान आईडी के रूप में उपयोग किया जाएगा।
ta: நீங்கள் ஒரு தனிப்பயன் ஐடியை வழங்கவில்லை என்றால், உங்கள் தொலைபேசி எண் உங்கள் விவசாயி ஐடியாக பயன்படுத்தப்படும்.

source: Enter valid phone
hi: मान्य फोन दर्ज करें
ta: சரியான தொலைபேசி உள்ளீடு செய்யுங்கள்

# idAlreadyInUse
source: Custom ID already in use
hi: कस्टम आईडी पहले से उपयोग में है
ta: தனிப்பயன் ஐடி ஏற்கனவே பயன்பாட்டில் உள்ளது

# registeredFarmerId
source: Registered — Farmer ID: {id}
hi: पंजीकृत — किसान आईडी: {id}
ta: பதிவு செய்யப்பட்டது — விவசாயி ஐடி: {id}

# registrationError
source: Registration error: {error}
hi: पंजीकरण त्रुटि: {error}
ta: பதிவு பிழை: {error}

source: Register Vet
hi: पशु चिकित्सक पंजीकरण करें
ta: மருத்துவர் பதிவு செய்

# registerAsVetDoctor
source: Register as Veterinary Doctor
hi: पशु चिकित्सक के रूप में पंजीकरण करें
ta: மருத்துவராக பதிவு செய்

# useProfessionalCredentials
source: Use professional credentials to register (username + password + vet id).
hi: पंजीकरण करने के लिए पेशेवर क्रेडेंशियल का उपयोग करें (उपयोगकर्ता नाम + पासवर्ड + पशु चिकित्सक आईडी)।
ta: பதிவு செய்ய தொழில்முறை சான்றுகளை பயன்படுத்துங்கள் (பயனர்பெயர் + கடவுச்சொல் + மருத்துவர் ஐடி).

source: Register with credentials
hi: क्रेडेंशियल के साथ पंजीकरण करें
ta: சான்றுகளுடன் பதிவு செய்

source: Create username + password + vet ID
hi: उपयोगकर्ता नाम + पासवर्ड + पशु चिकित्सक आईडी बनाएं
ta: பயனர்பெயர் + கடவுச்சொல் + மருத்துவர் ஐடி உருவாக்கு

source: Contact support
hi: सहायता से संपर्क करें
ta: உதவியை தொடர்பு கொள்

# enterpriseOnboarding
source: If you need enterprise onboarding let us know
hi: यदि आपको एंटरप्राइज ऑनबोर्डिंग की आवश्यकता है तो हमें बताएं
ta: உங்களுக்கு எண்டர்பிரைஸ் ஆன்போர்டிங் தேவையா என்றால் எங்களுக்கு தெரிவிக்கவும்

source: Contact support (placeholder)
hi: सहायता से संपर्क करें (प्लेसहोल्डर)
ta: உதவியை தொடர்பு கொள் (பிளேஸ்ஹோல்டர்)

source: Veterinary Registration
hi: पशु चिकित्सा पंजीकरण
ta: மருத்துவ பதிவு

source: Fill all fields
hi: सभी फ़ील्ड भरें
ta: அனைத்து புலங்களையும் நிரப்பு

# vetRegistered
source: Vet registered — use credentials to login
hi: पशु चिकित्सक पंजीकृत — लॉगिन करने के लिए क्रेडेंशियल का उपयोग करें
ta: மருத்துவர் பதிவு செய்யப்பட்டது — உள்நுழைய கடவுச்சொல்லை பயன்படுத்து

source: Farmer Dashboard
hi: किसान डैशबोर्ड
ta: விவசாயி டாஷ்போர்ட்

source: Logout
hi: लॉगआउट
ta: வெளியேறு

# animalsCount
source: Animals: {count} • In withdrawal: {withdrawal}
hi: जानवर: {count} • निकासी में: {withdrawal}
ta: விலங்குகள்: {count} • விலகலில்: {withdrawal}

source: Animal Database
hi: जानवर डेटाबेस
ta: விலங்கு தரவுத்தளம்

source: Manage animal database
hi: जानवर डेटाबेस प्रबंधित करें
ta: விலங்கு தரவுத்தளத்தை நிர்வகி

source: Add Animal
hi: जानवर जोड़ें
ta: விலங்கு சேர்க்க

source: Add new animal
hi: नया जानवर जोड़ें
ta: புதிய விலங்கு சேர்க்க

source: Guides
hi: गाइड
ta: வழிகாட்டிகள்

source: Withdrawal & dosing guides
hi: निकासी और खुराक गाइड
ta: விலகல் மற்றும் டோசிங் வழிகாட்டிகள்

source: Guides (placeholder)
hi: गाइड (प्लेसहोल्डर)
ta: வழிகாட்டிகள் (பிளேஸ்ஹோல்டர்)

source: Contact Vet
hi: पशु चिकित्सक से संपर्क करें
ta: மருத்துவரை தொடர்பு கொள்

source: Share Farmer ID with vet
hi: पशु चिकित्सक के साथ किसान आईडी साझा करें
ta: மருத்துவருடன் விவசாயி ஐடியை பகிர்

# shareId
source: Share ID: {id}
hi: आईडी साझा करें: {id}
ta: ஐடி பகிர்: {id}

source: Animal ID
hi: जानवर आईडी
ta: விலங்கு ஐடி

source: Enter id
hi: आईडी दर्ज करें
ta: ஐடி உள்ளீடு செய்

# generate
source: Gen
hi: जनरेट
ta: உருவாக்கு

source: Species
hi: प्रजाति
ta: இனம்

source: Select Species
hi: प्रजाति चुनें
ta: இனத்தை தேர்ந்தெடு

# age
source: Age (yrs)
hi: आयु (वर्ष)
ta: வயது (ஆண்டுகள்)

source: Enter age
hi: आयु दर्ज करें
ta: வயதை உள்ளீடு செய்

source: Breed
hi: नस्ल
ta: இனம்

source: Choose breed
hi: नस्ल चुनें
ta: இனம் தேர்ந்தெடு

source: Enter breed
hi: नस्ल दर्ज करें
ta: இனம் உள்ளீடு செய்

source: Save Animal
hi: जानवर सहेजें
ta: விலங்கு சேமி

source: Animal saved
hi: जानवर सहेजा गया
ta: விலங்கு சேமிக்கப்பட்டது

# animalDatabaseTitle
source: Animal Database
hi: जानवर डेटाबेस
ta: விலங்கு தரவுத்தளம்

# searchByIdSpeciesBreed
source: Search by id, species or breed
hi: आईडी, प्रजाति या नस्ल द्वारा खोजें
ta: ஐடி, இனம் அல்லது இனத்தால் தேடு

source: All
hi: सभी
ta: அனைத்தும்

source: No animals yet
hi: अभी तक कोई जानवर नहीं
ta: இன்னும் விலங்குகள் இல்லை

# tapAddCreateAnimals
source: Tap add to create animals
hi: जानवर बनाने के लिए जोड़ें पर टैप करें
ta: விலங்குகளை உருவாக்க சேர்க்கு என்பதைத் தட்டவும்

source: Animal Details
hi: जानवर विवरण
ta: விலங்கு விவரங்கள்

source: Close
hi: बंद करें
ta: மூடு

source: ID
hi: आईडी
ta: ஐடி

source: Last Medicine
hi: अंतिम दवा
ta: கடைசி மருந்து

source: Withdrawal End
hi: निकासी समाप्ति
ta: விலகல் முடிவு

source: Delete Animal
hi: जानवर हटाएं
ta: விலங்கு நீக்கு

source: Deleted
hi: हटाया गया
ta: நீக்கப்பட்டது

source: Vet Consulting
hi: पशु चिकित्सा परामर्श
ta: மருத்துவ ஆலோசனை

# enterFarmerIdOrPhone
source: Farmer ID or phone
hi: किसान आईडी या फोन
ta: விவசாயி ஐடி அல்லது தொலைபேசி

source: Load
hi: लोड करें
ta: ஏற்று

# loadedAnimals
source: Loaded animals — {count} total (demo)
hi: जानवर लोड किए गए — कुल {count} (डेमो)
ta: விலங்குகள் ஏற்றப்பட்டன — மொத்தம் {count} (டெமோ)

# enterFarmerId
source: Enter farmer id or phone
hi: किसान आईडी या फोन दर्ज करें
ta: விவசாயி ஐடி அல்லது தொலைபேசி உள்ளீடு செய்

source: No animals in database.
hi: डेटाबेस में कोई जानवर नहीं।
ta: தரவுத்தளத்தில் விலங்குகள் இல்லை.

source: Consult
hi: परामर्श
ta: ஆலோசனை

# consultAnimal
source: Consult • {id}
hi: परामर्श • {id}
ta: ஆலோசனை • {id}

source: Medicine
hi: दवा
ta: மருந்து (தட்டச்சு செய்ய தொடங்கு)

# dosage
source: Dosage (mg/kg)
hi: खुराक (mg/kg)
ta: டோஸ் (mg/kg)

# withdrawalPeriod
source: Withdrawal Period (days)
hi: निकासी अवधि (दिन)
ta: விலகல் காலம் (நாட்கள்)

# notes
source: Notes (optional)
hi: नोट्स (वैकल्पिक)
ta: குறிப்புகள் (விருப்பமானது)

source: Save Consultation
hi: परामर्श सहेजें
ta: ஆலோசனை சேமி

# savedToAnimalRecord
source: Saved consultation to animal record
hi: जानवर रिकॉर्ड में परामर्श सहेजा गया
ta: விலங்கு பதிவில் ஆலோசனை சேமிக்கப்பட்டது

source: Enter medicine
hi: दवा दर्ज करें
ta: மருந்து உள்ளீடு செய்

source: Consulting History
hi: परामर्श इतिहास
ta: ஆலோசனை வரலாறு

# noConsultationHistory
source: Consultation history placeholder (persist when you need).
hi: परामर्श इतिहास प्लेसहोल्डर (जब आवश्यक हो तो बनाए रखें)।
ta: ஆலோசனை வரலாறு பிளேஸ்ஹோல்டர் (தேவைப்படும்போது சேமி).

source: Seller Dashboard
hi: विक्रेता डैशबोर्ड
ta: விற்பனையாளர் டாஷ்போர்ட்

source: Food Scanner
hi: खाद्य स्कैनर
ta: உணவு ஸ்கேனர்

source: Scan food/QR
hi: खाद्य/QR स्कैन करें
ta: உணவு/QR ஸ்கேன் செய்

source: Animal Scanner
hi: जानवर स्कैनर
ta: விலங்கு ஸ்கேனர்

source: Scan animal tag
hi: जानवर टैग स्कैन करें
ta: விலங்கு டேக் ஸ்கேன் செய்

source: Food scanner placeholder
hi: खाद्य स्कैनर प्लेसहोल्डर
ta: உணவு ஸ்கேனர் பிளேஸ்ஹோல்டர்

source: Animal scanner placeholder
hi: जानवर स्कैनर प्लेसहोल्डर
ta: விலங்கு ஸ்கேனர் பிளேஸ்ஹோல்டர்

source: Camera
hi: कैमरा
ta: கேமரா

# imageCaptured
source: Image captured: {path}
hi: छवि कैप्चर की गई: {path}
ta: படம் கேப்சர் செய்யப்பட்டது: {path}

source: Camera not available
hi: कैमरा उपलब्ध नहीं है
ta: கேமரா கிடைக்கவில்லை

# errorCapturingImage
source: Error capturing image: {error}
hi: छवि कैप्चर करने में त्रुटि: {error}
ta: படம் கேப்சர் செய்யும் பிழை: {error}

source: Safe
hi: सुरक्षित
ta: பாதுகாப்பானது

source: In Withdrawal
hi: निकासी में
ta: விலகலில்

source: Phone Number
hi: फोन नंबर
ta: தொலைபேசி எண்

source: Farmer ID
hi: किसान आईडी
ta: விவசாயி ஐடி

source: Guest
hi: अतिथि
ta: விருந்தினர்

source: Home
hi: होम
ta: முகப்பு

source: Animals
hi: जानवर
ta: விலங்குகள்

source: History
hi: इतिहास
ta: வரலாறு

# noHistoryYet
source: No consultation history yet.
hi: अभी तक कोई परामर्श इतिहास नहीं।
ta: இன்னும் ஆலோசனை வரலாறு இல்லை.

# lastMedicineDosage
source: Last Medicine: {medicine} • {dosage} mg/kg Withdrawal End: {end}
hi: अंतिम दवा: {medicine} • {dosage} mg/kg निकासी समाप्ति: {end}
ta: கடைசி மருந்து: {medicine} • {dosage} mg/kg விலகல் முடிவு: {end}

source: Unknown
hi: अज्ञात
ta: தெரியாதது

source: Select Language
hi: भाषा चुनें
ta: மொழி தேர்ந்தெடு

# tamil
source: தமிழ்
hi: तमिल

source: Choose Your Language
hi: अपनी भाषा चुनें
ta: உங்கள் மொழியை தேர்ந்தெடுக்கவும்

# continueButton
source: Continue
hi: जारी रखें
ta: தொடர்ந்து

source: Enter username/password/vet id
hi: उपयोगकर्ता नाम/पासवर्ड/पशु चिकित्सक आईडी दर्ज करें
ta: பயனர்பெயர்/கடவுச்சொல்/மருத்துவர் ஐடி உள்ளீடு செய்யுங்கள்

source: Product Type
hi: उत्पाद प्रकार
ta: தயாரிப்பு வகை

source: MRL Information
hi: एमआरएल जानकारी
ta: எம்ஆர்எல் தகவல்

source: Current MRL
hi: वर्तमान एमआरएल
ta: தற்போதைய எம்ஆர்எல்

source: Status
hi: स्थिति
ta: நிலை

source: Withdrawal Days
hi: निकासी दिन
ta: விலகல் நாட்கள்

source: All Status
hi: सभी स्थिति
ta: அனைத்து நிலை

source: Withdrawal
hi: निकासी
ta: விலகல்

# ageWithValue
source: Age • {age}
hi: आयु • {age}
ta: வயது • {age}

source: View
hi: देखें
ta: பார்க்க

source: Delete
hi: हटाएं
ta: நீக்கு

source: Added to database
hi: डेटाबेस में जोड़ा गया
ta: தரவுத்தளத்தில் சேர்க்கப்பட்டது

source: Withdrawal Guides
hi: निकासी गाइड
ta: விலகல் வழிகாட்டிகள்

source: No animals in withdrawal period
hi: निकासी अवधि में कोई जानवर नहीं
ta: விலகல் காலத்தில் விலங்குகள் இல்லை

# allAnimalsSafeForConsumption
source: All your animals are safe for consumption
hi: आपके सभी जानवर उपभोग के लिए सुरक्षित हैं
ta: உங்கள் அனைத்து விலங்குகளும் நுகர்வுக்கு பாதுகாப்பானவை

source: Withdrawal Details
hi: निकासी विवरण
ta: விலகல் விவரங்கள்

source: Time Remaining
hi: शेष समय
ta: மீதமுள்ள நேரம்

# medicineAndWithdrawal
source: Medicine & Withdrawal
hi: दवा और निकासी
ta: மருந்து மற்றும் விலகல்

source: Consulting Vet
hi: परामर्शी पशु चिकित्सक
ta: ஆலோசனை மருத்துவர்

source: No vet assigned
hi: कोई पशु चिकित्सक नियुक्त नहीं
ta: மருத்துவர் ஒதுக்கப்படவில்லை

source: View MRL Graph
hi: एमआरएल ग्राफ देखें
ta: எம்ஆர்எல் வரைபடத்தை பார்க்க

source: Started
hi: शुरू हुआ
ta: தொடங்கியது

source: Ends
hi: समाप्त होता है
ta: முடிகிறது

source: Prescriptions
hi: दवा निर्देश
ta: மருந்து பரிந்துரைகள்

source: QR Codes
hi: QR कोड
ta: QR குறியீடுகள்

source: Analytics
hi: विश्लेषण
ta: பகுப்பாய்வு

source: Alerts
hi: अलर्ट
ta: எச்சரிக்கைகள்

source: Blockchain
hi: ब्लॉकचेन
ta: பிளாக்செயின்

source: No Digital Prescriptions
hi: कोई डिजिटल दवा निर्देश नहीं
ta: டிஜிட்டல் மருந்து பரிந்துரைகள் இல்லை

# prescriptionsWillAppearHere
source: Prescriptions will appear here after veterinary consultations
hi: पशु चिकित्सा परामर्श के बाद दवा निर्देश यहां दिखाई देंगे
ta: மருத்துவ ஆலோசனைகளுக்குப் பிறகு மருந்து பரிந்துரைகள் இங்கே தோன்றும்

source: Prescription for
hi: दवा निर्देश
ta: மருந்து பரிந்துரை

source: Active
hi: सक्रिय
ta: செயலில்

source: Completed
hi: पूर्ण
ta: முடிந்தது

source: Digital Prescription
hi: डिजिटल दवा निर्देश
ta: டிஜிட்டல் மருந்து பரிந்துரை

source: Prescription Status
hi: दवा निर्देश स्थिति
ta: மருந்து பரிந்துரை நிலை

source: Active - Withdrawal Period
hi: निकासी अवधि सक्रिय
ta: விலகல் காலம் செயலில்

source: Completed - Safe to Consume
hi: पूर्ण - उपभोग के लिए सुरक्षित
ta: முடிந்தது - நுகர்வுக்கு பாதுகாப்பானது

source: Animal Information
hi: जानवर जानकारी
ta: விலங்கு தகவல்

source: Prescription Details
hi: दवा निर्देश विवरण
ta: மருந்து பரிந்துரை விவரங்கள்

source: Prescribed by
hi: निर्देशक
ta: பரிந்துரை செய்தவர்

source: View Details
hi: विवरण देखें
ta: விவரங்களை பார்க்க

source: QR Certificate Generator
hi: QR प्रमाणपत्र जनरेटर
ta: QR சான்றிதழ் உருவாக்கி

# generateQrCodesForAnimalCertificates
source: Generate QR codes for animal certificates with safety status
hi: जानवर प्रमाणपत्रों के लिए QR कोड जनरेट करें
ta: விலங்கு சான்றிதழ்களுக்கு QR குறியீடுகளை உருவாக்குங்கள்

source: QR Generation Date
hi: QR जनरेशन तिथि
ta: QR உருவாக்க தேதி

source: No Animals Available
hi: कोई जानवर उपलब्ध नहीं
ta: விலங்குகள் கிடைக்கவில்லை

source: Add animals to generate QR certificates
hi: QR प्रमाणपत्र जनरेट करने के लिए जानवर जोड़ें
ta: QR சான்றிதழ்களை உருவாக்க விலங்குகளை சேர்க்கவும்

source: Generate QR Certificate
hi: QR प्रमाणपत्र जनरेट करें
ta: QR சான்றிதழ் உருவாக்கு

source: QR Certificate Generated
hi: QR प्रमाणपत्र जनरेट किया गया
ta: QR சான்றிதழ் உருவாக்கப்பட்டது

source: ANIMAL IN WITHDRAWAL - NOT SAFE TO CONSUME
hi: जानवर निकासी में है - उपभोग के लिए सुरक्षित नहीं
ta: விலங்கு விலகலில் உள்ளது - நுகர்வுக்கு பாதுகாப்பல்ல

# doNotConsumeProducts
source: Do not consume products from this animal until withdrawal period ends.
hi: इस जानवर के उत्पादों का उपभोग न करें
ta: இந்த விலங்கின் தயாரிப்புகளை நுகர்வு செய்ய வேண்டாம்

source: Certificate Details
hi: प्रमाणपत्र विवरण
ta: சான்றிதழ் விவரங்கள்

source: Valid Until
hi: मान्य तक
ta: செல்லுபடியாகும் வரை

source: Withdrawal Ends
hi: निकासी समाप्त
ta: விலகல் முடிகிறது

source: Share
hi: साझा करें
ta: பகிர்

source: Farm Analytics
hi: खेत विश्लेषण
ta: பண்ணை பகுப்பாய்வு

source: Animal Health Analytics
hi: जानवर स्वास्थ्य विश्लेषण
ta: விலங்கு ஆரோக்கிய பகுப்பாய்வு

source: Withdrawal Period Analytics
hi: निकासी अवधि विश्लेषण
ta: விலகல் கால பகுப்பாய்வு

source: MRL Compliance Analytics
hi: एमआरएल अनुपालन विश्लेषण
ta: எம்ஆர்எல் இணங்கல் பகுப்பாய்வு

source: Farm Alerts
hi: खेत अलर्ट
ta: பண்ணை எச்சரிக்கைகள்

source: Withdrawal Alerts
hi: निकासी अलर्ट
ta: விலகல் எச்சரிக்கைகள்

source: Health Alerts
hi: स्वास्थ्य अलर्ट
ta: ஆரோக்கிய எச்சரிக்கைகள்

source: Compliance Alerts
hi: अनुपालन अलर्ट
ta: இணங்கல் எச்சரிக்கைகள்

source: Blockchain Verification
hi: ब्लॉकचेन सत्यापन
ta: பிளாக்செயின் சரிபார்ப்பு

source: Animal Records on Blockchain
hi: ब्लॉकचेन पर जानवर रिकॉर्ड
ta: பிளாக்செயினில் விலங்கு பதிவுகள்

source: Verify Animal Data
hi: जानवर डेटा सत्यापित करें
ta: விலங்கு தரவை சரிபார்க்க

source: Blockchain Transactions
hi: ब्लॉकचेन लेनदेन
ta: பிளாக்செயின் பரிவர்த்தனைகள்

source: AI Vet Assistant
hi: AI पशु चिकित्सक सहायक
ta: AI மருத்துவ உதவியாளர்

source: AI Treatment Recommendations
hi: AI उपचार सिफारिशें
ta: AI சிகிச்சை பரிந்துரைகள்

source: Get AI Recommendations
hi: AI सिफारिशें प्राप्त करें
ta: AI பரிந்துரைகளை பெற

source: AI Health Analysis
hi: AI स्वास्थ्य विश्लेषण
ta: AI ஆரோக்கிய பகுப்பாய்வு

source: Share with Vet
hi: पशु चिकित्सक के साथ साझा करें
ta: மருத்துவருடன் பகிர்

source: Digital Certificate
hi: डिजिटल प्रमाणपत्र
ta: டிஜிட்டல் சான்றிதழ்

source: Withdrawal Period Active
hi: निकासी अवधि सक्रिय
ta: விலகல் காலம் செயலில்

source: Withdrawal Period Completed
hi: निकासी अवधि पूर्ण
ta: விலகல் காலம் முடிந்தது

# endsOn
source: Ends
hi: समाप्त होता है
ta: முடிகிறது

# certificateReadyForSharing
source: QR Certificate ready for sharing
hi: साझा करने के लिए QR प्रमाणपत्र तैयार
ta: பகிர்வுக்கு QR சான்றிதழ் தயாராக உள்ளது

source: Animal Identification
hi: जानवर पहचान
ta: விலங்கு அடையாளம்

source: Enter unique animal ID
hi: अद्वितीय जानवर आईडी दर्ज करें
ta: தனித்துவமான விலங்கு ஐடியை உள்ளீடு செய்யுங்கள்

source: Generate ID
hi: आईडी जनरेट करें
ta: ஐடி உருவாக்கு

# pleaseEnterAnimalId
source: Please enter an animal ID
hi: कृपया जानवर आईडी दर्ज करें
ta: விலங்கு ஐடியை உள்ளீடு செய்யுங்கள்

# pleaseSelectSpecies
source: Please select a species
hi: कृपया प्रजाति चुनें
ta: இனத்தை தேர்ந்தெடுக்கவும்

source: Breed & Age Details
hi: नस्ल और आयु विवरण
ta: இனம் மற்றும் வயது விவரங்கள்

source: Please enter age
hi: कृपया आयु दर्ज करें
ta: வயதை உள்ளீடு செய்யுங்கள்

# enterValidAge
source: Enter valid age (0-50)
hi: मान्य आयु दर्ज करें (0-50)
ta: சரியான வயதை உள்ளீடு செய்யுங்கள் (0-50)

source: Enter Custom Breed
hi: कस्टम नस्ल दर्ज करें
ta: தனிப்பயன் இனத்தை உள்ளீடு செய்யுங்கள்

source: Enter breed name
hi: नस्ल का नाम दर्ज करें
ta: இனத்தின் பெயரை உள்ளீடு செய்யுங்கள்

# pleaseSelectBreed
source: Please select a breed
hi: कृपया नस्ल चुनें
ta: இனத்தை தேர்ந்தெடுக்கவும்

source: Please enter breed
hi: कृपया नस्ल दर्ज करें
ta: இனத்தை உள்ளீடு செய்யுங்கள்

source: Other (Custom)
hi: अन्य (कस्टम)
ta: மற்றவை (தனிப்பயன்)

source: Select species first
hi: पहले प्रजाति चुनें
ta: முதலில் இனத்தை தேர்ந்தெடு

source: Saving...
hi: सहेजा जा रहा है...
ta: சேமிக்கப்படுகிறது...

source: Animal added successfully!
hi: जानवर सफलतापूर्वक जोड़ा गया!
ta: விலங்கு வெற்றிகரமாக சேர்க்கப்பட்டது!

# failedToSaveAnimal
source: Failed to save animal. Please try again.
hi: जानवर सहेजने में विफल। कृपया पुनः प्रयास करें।
ta: விலங்கை சேமிக்க இயலவில்லை. மீண்டும் முயற்சிக்கவும்.

source: All Types
hi: सभी प्रकार
ta: அனைத்து வகைகளும்

source: Withdrawal Warning
hi: निकासी चेतावनी
ta: விலகல் எச்சரிக்கை

source: Withdrawal Expired
hi: निकासी समाप्त
ta: விலகல் காலாவதியானது

source: MRL Violation
hi: एमआरएल उल्लंघन
ta: எம்ஆர்எல் மீறல்

source: Treatment Overdue
hi: उपचार अतिदेय
ta: சிகிச்சை காலாவதியானது

source: Compliance Risk
hi: अनुपालन जोखिम
ta: இணங்கல் ஆபத்து

source: All Severities
hi: सभी गंभीरताएं
ta: அனைத்து தீவிரங்கள்

source: Total Alerts
hi: कुल अलर्ट
ta: மொத்த எச்சரிக்கைகள்

source: Unread
hi: अपठित
ta: படிக்காதவை

source: Critical
hi: गंभीर
ta: முக்கியமானது

source: No alerts found
hi: कोई अलर्ट नहीं मिला
ta: எச்சரிக்கைகள் எதுவும் கிடைக்கவில்லை

# allComplianceChecksPassing
source: All compliance checks are passing
hi: सभी अनुपालन जांच पास हो रही हैं
ta: அனைத்து இணங்கல் சரிபார்ப்புகளும் தேர்ச்சி பெறுகின்றன

source: Create Custom Alert
hi: कस्टम अलर्ट बनाएं
ta: தனிப்பயன் எச்சரிக்கை உருவாக்கு

source: Alert Title
hi: अलर्ट शीर्षक
ta: எச்சரிக்கை தலைப்பு

source: Alert Message
hi: अलर्ट संदेश
ta: எச்சரிக்கை செய்தி

source: Severity
hi: गंभीरता
ta: தீவிரம்

source: Alert Type
hi: अलर्ट प्रकार
ta: எச்சரிக்கை வகை

source: Create Alert
hi: अलर्ट बनाएं
ta: எச்சரிக்கை உருவாக்கு

source: Read
hi: पढ़ें
ta: படி

source: Mark as Read
hi: पढ़ा हुआ मार्क करें
ta: படித்ததாக குறி

source: Dismiss
hi: खारिज करें
ta: நிராகரி

source: Just now
hi: अभी अभी
ta: இப்போதே

# minutesAgo
source: {count} minutes ago
hi: {count} मिनट पहले
ta: {count} நிமிடங்களுக்கு முன்பு
