Repository: subashree639/BIOSECURITY
Catalog: lib/l10n/app_*.arb
Languages: hi, ta

# hoursAgo
source: {count} hours ago
hi: {count} घंटे पहले
ta: {count} மணி நேரங்களுக்கு முன்பு

# daysAgo
source: {count} days ago
hi: {count} दिन पहले
ta: {count} நாட்களுக்கு முன்பு

source: Low
hi: कम
ta: குறைவு

source: Medium
hi: मध्यम
ta: நடுத்தரம்

source: High
hi: उच्च
ta: அதிகம்

# animalIdLabel
source: Animal ID: {id}
hi: जानवर आईडी: {id}
ta: விலங்கு ஐடி: {id}

source: Cow
hi: गाय
ta: மாடு

source: Buffalo
hi: भैंस
ta: எருமை

source: Goat
hi: बकरी
ta: ஆடு

source: Sheep
hi: भेड़
ta: செம்மறி ஆடு

source: Pig
hi: सूअर
ta: பன்றி

source: Poultry
hi: कुखुरा
ta: கோழி

source: Other
hi: अन्य
ta: மற்றவை

source: Jersey
hi: जर्सी
ta: ஜெர்சி

source: Holstein
hi: होलस्टीन
ta: ஹால்ஸ்டைன்

source: Sahiwal
hi: सहिवाल
ta: சஹிவால்

source: Gir
hi: गिर
ta: கிர்

source: Red Sindhi
hi: लाल सिंधी
ta: சிவப்பு சிந்தி

source: Tharparkar
hi: थारपारकर
ta: தார்பார்கர்

source: Murrah
hi: मुर्रा
ta: முற்றா

source: Nili-Ravi
hi: नीली रावी
ta: நீலி ராவி

source: Jaffarabadi
hi: जाफराबादी
ta: ஜஃபராபாதி

source: Surti
hi: सुरती
ta: சூர்தி

source: Bhadawari
hi: भदावरी
ta: பாதவரி

source: Beetal
hi: बीटल
ta: பீட்டல்

source: Boer
hi: बोअर
ta: போயர்

source: Jamunapari
hi: जामुनापरी
ta: ஜாமுனபாரி

source: Sirohi
hi: सिरोही
ta: சிரோஹி

source: Barbari
hi: बारबरी
ta: பார்பரி

source: Merino
hi: मेरिनो
ta: மெரினோ

source: Rambouillet
hi: रैम्बौलिए
ta: ராம்போலியட்

source: Cheviot
hi: शेवियट
ta: செவியாட்

source: Suffolk
hi: सफ़ोक
ta: சஃபோக்

source: Hampshire
hi: हैंपशायर
ta: ஹாம்ப்ஷயர்

source: Large White
hi: लार्ज व्हाइट
ta: பெரிய வெள்ளை

source: Yorkshire
hi: यॉर्कशायर
ta: யார்க்ஷயர்

source: Berkshire
hi: बर्कशायर
ta: பெர்க்ஷயர்

source: Desi
hi: देशी
ta: தேசி

source: Layer
hi: लेयर
ta: லேயர்

source: Broiler
hi: ब्रॉयलर
ta: ப்ராய்லர்

source: AMU Analytics Dashboard
hi: एएमयू एनालिटिक्स डैशबोर्ड
ta: ஏஎம்யூ பகுப்பாய்வு டாஷ்போர்ட்

source: No data available
hi: कोई डेटा उपलब्ध नहीं
ta: தரவு எதுவும் கிடைக்கவில்லை

# analysisPeriod
source: Analysis Period: {start} to {end}
hi: विश्लेषण अवधि: {start} से {end}
ta: பகுப்பாய்வு காலம்: {start} முதல் {end}

source: Summary Statistics
hi: सारांश आंकड़े
ta: சுருக்கமான புள்ளியியல்

source: Total Animals
hi: कुल जानवर
ta: மொத்த விலங்குகள்

source: Animals Treated
hi: उपचारित जानवर
ta: சிகிச்சையளிக்கப்பட்ட விலங்குகள்

source: Treatment Rate
hi: उपचार दर
ta: சிகிச்சை விகிதம்

source: Compliance Issues
hi: अनुपालन मुद्दे
ta: இணங்கல் சிக்கல்கள்

source: Trend Analysis
hi: प्रवृत्ति विश्लेषण
ta: மரபு பகுப்பாய்வு

source: Trend Direction
hi: प्रवृत्ति दिशा
ta: மரபு திசை

source: Volatility
hi: अस्थिरता
ta: அதிர்ச்சி

source: Seasonal Patterns
hi: मौसमी पैटर्न
ta: பருவகால முறைகள்

source: No seasonal patterns detected
hi: कोई मौसमी पैटर्न नहीं पाया गया
ta: பருவகால முறைகள் எதுவும் கண்டறியப்படவில்லை

# peakMonths
source: Peak months: {months}
hi: पीक महीने: {months}
ta: உச்ச மாதங்கள்: {months}

# lowMonths
source: Low months: {months}
hi: कम महीने: {months}
ta: குறைவான மாதங்கள்: {months}

source: Compliance Analysis
hi: अनुपालन विश्लेषण
ta: இணங்கல் பகுப்பாய்வு

source: Compliance Rate
hi: अनुपालन दर
ta: இணங்கல் விகிதம்

source: Compliant Animals
hi: अनुपालित जानवर
ta: இணங்கிய விலங்குகள்

source: Risk Factors
hi: जोखिम कारक
ta: ஆபத்து காரணிகள்

# noSignificantRiskFactors
source: No significant risk factors identified
hi: कोई महत्वपूर्ण जोखिम कारक नहीं पहचाना गया
ta: முக்கியமான ஆபத்து காரணிகள் எதுவும் அடையாளம் காணப்படவில்லை

# noMedicineUsageData
source: No medicine usage data available
hi: कोई दवा उपयोग डेटा उपलब्ध नहीं
ta: மருந்து பயன்பாட்டு தரவு எதுவும் கிடைக்கவில்லை

source: Medicine Usage Distribution
hi: दवा उपयोग वितरण
ta: மருந்து பயன்பாட்டு விநியோகம்

source: No recommendations available
hi: कोई सिफारिशें उपलब्ध नहीं
ta: பரிந்துரைகள் எதுவும் கிடைக்கவில்லை

source: Recommendations
hi: सिफारिशें
ta: பரிந்துரைகள்

# failedToLoadAnalytics
source: Failed to load analytics: {error}
hi: एनालिटिक्स लोड करने में विफल: {error}
ta: பகுப்பாய்வை ஏற்றுவதில் தோல்வி: {error}

# addAnimalsFirstAi
source: Add some animals first to get AI recommendations
hi: AI सिफारिशें प्राप्त करने के लिए पहले कुछ जानवर जोड़ें
ta: AI பரிந்துரைகளைப் பெற சில விலங்குகளை முதலில் சேர்க்கவும்

# failedToGetAiRecommendations
source: Failed to get AI recommendations: {error}
hi: AI सिफारिशें प्राप्त करने में विफल: {error}
ta: AI பரிந்துரைகளைப் பெறுவதில் தோல்வி: {error}

# noSpecificRecommendations
source: No specific recommendations at this time
hi: इस समय कोई विशिष्ट सिफारिशें नहीं
ta: இந்த நேரத்தில் குறிப்பிட்ட பரிந்துரைகள் எதுவும் இல்லை

source: Health Score
hi: स्वास्थ्य स्कोर
ta: ஆரோக்கிய மதிப்பெண்

source: AI Recommendations
hi: AI सिफारिशें
ta: AI பரிந்துரைகள்

source: Preventive Care
hi: निवारक देखभाल
ta: தடுப்பு பராமரிப்பு

# failedToAnalyzeHealth
source: Failed to analyze health: {error}
hi: स्वास्थ्य विश्लेषण करने में विफल: {error}
ta: ஆரோக்கியத்தை பகுப்பாய்வு செய்வதில் தோல்வி: {error}

source: Logging out...
hi: लॉग आउट हो रहा है...
ta: வெளியேறுகிறது...

# aiTreatmentRecommendationsDesc
source: AI treatment recommendations
hi: AI उपचार सिफारिशें
ta: AI சிகிச்சை பரிந்துரைகள்

# ageAddedToDatabase
source: Age: {age} • Added to database
hi: आयु: {age} • डेटाबेस में जोड़ा गया
ta: வயது: {age} • தரவுத்தளத்தில் சேர்க்கப்பட்டது

source: Search animals
hi: जानवर खोजें
ta: விலங்குகளைத் தேடு

# withdrawalStatus
source: Withdrawal
hi: निकासी
ta: விலகல்

# safeStatus
source: Safe
hi: सुरक्षित
ta: பாதுகாப்பானது

# inWithdrawalStatus
source: In Withdrawal
hi: निकासी में
ta: விலகலில்

# viewButton
source: View
hi: देखें
ta: பார்

# deleteButton
source: Delete
hi: हटाएं
ta: நீக்கு

# deletedMessage
source: Deleted
hi: हटाया गया
ta: நீக்கப்பட்டது

source: Prescription for {species}
hi: प्रिस्क्रिप्शन {species} के लिए
ta: {species} க்கான மருந்து பரிந்துரை

# activeStatus
source: Active
hi: सक्रिय
ta: செயலில்

# completedStatus
source: Completed
hi: पूर्ण
ta: முடிந்தது

# medicineLabel
source: Medicine
hi: दवा
ta: மருந்து

# dosageLabel
source: Dosage
hi: खुराक
ta: அளவு

# withdrawalPeriodLabel
source: Withdrawal Period
hi: निकासी अवधि
ta: விலகல் காலம்

# endsLabel
source: Ends
hi: समाप्त होता है
ta: முடிகிறது

# prescribedByLabel
source: Prescribed by: {vet}
hi: निर्देशक: {vet}
ta: பரிந்துரைத்தவர்: {vet}

# viewDetailsButton
source: View Details
hi: विवरण देखें
ta: விவரங்களைப் பார்

# digitalPrescriptionTitle
source: Digital Prescription
hi: डिजिटल प्रिस्क्रिप्शन
ta: டிஜிட்டல் மருந்து பரிந்துரை

# prescriptionStatusLabel
source: Prescription Status
hi: प्रिस्क्रिप्शन स्थिति
ta: மருந்து பரிந்துரை நிலை

# activeWithdrawalPeriodStatus
source: Active - Withdrawal Period
hi: सक्रिय - निकासी अवधि
ta: செயலில் - விலகல் காலம்

# completedSafeToConsumeStatus
source: Completed - Safe to Consume
hi: पूर्ण - उपभोग के लिए सुरक्षित
ta: முடிந்தது - நுகர்வுக்கு பாதுகாப்பானது

# animalInformationSection
source: Animal Information
hi: जानवर जानकारी
ta: விலங்கு தகவல்

# prescriptionDetailsSection
source: Prescription Details
hi: प्रिस्क्रिप्शन विवरण
ta: மருந்து பரிந்துரை விவரங்கள்

# speciesAndBreedLabel
source: Species & Breed: {species} - {breed}
hi: प्रजाति और नस्ल: {species} - {breed}
ta: இனம் மற்றும் வயது: {species} - {breed}

# productTypeLabel
source: Product Type
hi: उत्पाद प्रकार
ta: தயாரிப்பு வகை

# prescribedDateLabel
source: Prescribed Date: {date}
hi: निर्दिष्ट तिथि: {date}
ta: பரிந்துரைக்கப்பட்ட தேதி: {date}

# withdrawalEndsLabel
source: Withdrawal Ends: {date}
hi: निकासी समाप्त: {date}
ta: விலகல் முடிகிறது: {date}

# mrlStatusSection
source: MRL Status
hi: एमआरएल स्थिति
ta: எம்ஆர்எல் நிலை

# currentMrlLabel
source: Current MRL: {mrl} units
hi: वर्तमान एमआरएल: {mrl} इकाइयाँ
ta: தற்போதைய எம்ஆர்எல்: {mrl} அலகுகள்

# statusLabel
source: Status: {status}
hi: स्थिति: {status}
ta: நிலை: {status}

# veterinaryInformationSection
source: Veterinary Information
hi: पशु चिकित्सा जानकारी
ta: மருத்துவ தகவல்

# consultingVetLabel
source: Consulting Vet: {vet}
hi: परामर्शी पशु चिकित्सक: {vet}
ta: ஆலோசனை மருத்துவர்: {vet}

# vetIdLabel
source: Vet ID: {id}
hi: पशु चिकित्सक आईडी: {id}
ta: மருத்துவர் ஐடி: {id}

# noVetAssignedMessage
source: No vet assigned
hi: कोई पशु चिकित्सक नियुक्त नहीं
ta: மருத்துவர் எவரும் ஒதுக்கப்படவில்லை

# viewMrlGraphButton
source: View MRL Graph
hi: एमआरएल ग्राफ देखें
ta: எம்ஆர்எல் வரைபடத்தைப் பார்

# noAnimalsAvailableMessage
source: No Animals Available
hi: कोई जानवर उपलब्ध नहीं
ta: விலங்குகள் எதுவும் கிடைக்கவில்லை

# addAnimalsToGenerateQrMessage
source: Add animals to generate QR certificates
hi: QR प्रमाणपत्र जनरेट करने के लिए जानवर जोड़ें
ta: QR சான்றிதழ்களை உருவாக்க விலங்குகளைச் சேர்க்கவும்

# qrCertificateGeneratorTitle
source: QR Certificate Generator
hi: QR प्रमाणपत्र जनरेटर
ta: QR சான்றிதழ் உருவாக்கி

# generateQrCodesDesc
source: Generate QR codes for animal certificates with safety status
hi: जानवर प्रमाणपत्रों के लिए QR कोड जनरेट करें
ta: விலங்கு சான்றிதழ்களுக்கு QR குறியீடுகளை உருவாக்கு

# qrGenerationDateLabel
source: QR Generation Date: {date}
hi: QR जनरेशन तिथि: {date}
ta: QR உருவாக்க தேதி: {date}

# idDisplay
source: ID: {id}
hi: आईडी: {id}
ta: ஐடி: {id}

# withdrawalPeriodActiveMessage
source: Withdrawal Period Active
hi: निकासी अवधि सक्रिय
ta: விலகல் காலம் செயலில்

# withdrawalPeriodCompletedMessage
source: Withdrawal Period Completed
hi: निकासी अवधि पूर्ण
ta: விலகல் காலம் முடிந்தது

# endsDateDisplay
source: Ends: {date}
hi: समाप्त: {date}
ta: முடிகிறது: {date}

# generateQrCertificateButton
source: Generate QR Certificate
hi: QR प्रमाणपत्र जनरेट करें
ta: QR சான்றிதழை உருவாக்கு

# generatingQrCertificateMessage
source: Generating QR Certificate...
hi: QR प्रमाणपत्र जनरेट हो रहा है...
ta: QR சான்றிதழ் உருவாக்கப்படுகிறது...

# qrCertificateGeneratedTitle
source: QR Certificate Generated
hi: QR प्रमाणपत्र जनरेट किया गया
ta: QR சான்றிதழ் உருவாக்கப்பட்டது

# animalInWithdrawalWarning
source: ⚠️ ANIMAL IN WITHDRAWAL - NOT SAFE TO CONSUME
hi: ⚠️ जानवर निकासी में है - उपभोग के लिए सुरक्षित नहीं
ta: ⚠️ விலங்கு விலகலில் உள்ளது - நுகர்வுக்கு பாதுகாப்பானது அல்ல

# safeToConsumeMessage
source: ✅ SAFE TO CONSUME
hi: ✅ उपभोग के लिए सुरक्षित
ta: ✅ நுகர்வுக்கு பாதுகாப்பானது

# doNotConsumeWarning
source: Do not consume products from this animal until withdrawal period ends.
hi: इस जानवर के उत्पादों का उपभोग न करें
ta: விலகல் காலம் முடியும் வரை இந்த விலங்கின் தயாரிப்புகளை நுகர வேண்டாம்.

# certificateDetailsSection
source: Certificate Details
hi: प्रमाणपत्र विवरण
ta: சான்றிதழ் விவரங்கள்

# speciesLabel
source: Species
hi: प्रजाति
ta: இனம்

# farmerIdLabel
source: Farmer ID: {id}
hi: किसान आईडी: {id}
ta: விவசாயி ஐடி: {id}

# generatedDateLabel
source: Generated Date: {date}
hi: जनरेट तिथि: {date}
ta: உருவாக்கப்பட்ட தேதி: {date}

# validUntilLabel
source: Valid Until: {date}
hi: मान्य तक: {date}
ta: செல்லுபடியாகும் வரை: {date}

# qrCertificateReadyMessage
source: QR Certificate ready for sharing
hi: साझा करने के लिए QR प्रमाणपत्र तैयार
ta: பகிர்வுக்கு QR சான்றிதழ் தயாராக உள்ளது

# errorTitle
source: Error
hi: त्रुटि
ta: பிழை

# failedToGenerateQrMessage
source: Failed to generate QR certificate: {error}
hi: QR प्रमाणपत्र जनरेट करने में विफल: {error}
ta: QR சான்றிதழை உருவாக்குவதில் தோல்வி: {error}
